posts/my-opinions-on-notetaking.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-19 Fri 12:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>my opinions on task management and notes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="josiah">
<link rel="stylesheet" type="text/css" href="css/my-dark.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
</head>
<body>
<div id="preamble" class="status">
<a href="../index.html">home</a>
<a href="../posts/articles.html">essays</a>
<a href="../personal/articles.html">diary</a>
<a href="https://git.awful.club/projects">projects</a>
<a href="../resume.pdf">resume</a>
<a href="../lore.html">lore</a>
</div>
<div id="content">
<header>
<h1 class="title">my opinions on task management and notes</h1>
</header>
<div id="outline-container-orgb509bf7" class="outline-2">
<h2 id="orgb509bf7">Introduction</h2>
<div class="outline-text-2" id="text-orgb509bf7">
<p>
Note taking systems have come up at work a lot; flavor of the month applications (Roam Research! Obisidian!); whether you should write up notes in a private wiki; particular ideologies like <a href="https://en.wikipedia.org/wiki/Zettelkasten">Zettelkasten</a> (ZTK) or <a href="https://en.wikipedia.org/wiki/Getting_Things_Done">Getting Things Done</a> (GTD); etc. I have A Lot of Opinions about note taking and productivity, and wrote up a quick and dirty summary of options on apps / ideology for coworkers. This post is a longer form write up on task management, productivity systems, and notes generally from that original summary.
</p>

<p>
This post assumes you are a knowledge worker of some kind, and thus have a need for the heavier weight systems like ZTK or GTD. This post does not assume you are a programmer or work in tech, specifically. My goal is for you to feel comfortable reading this regardless of technical aptitude &#x2013; if you're the kind of person who needs a robust note / task management system then I want to help!
</p>
</div>
</div>

<div id="outline-container-org30eb4b8" class="outline-2">
<h2 id="org30eb4b8">Concepts / ideology / religious warfare</h2>
<div class="outline-text-2" id="text-org30eb4b8">
<p>
Always start with ideas before implementation. I'm sure there's more sects out there than I am aware of, but broadly there are three mainstream knowledge management styles: Zettelkasten, Getting Things Done, and then just "writing shit down and hoping you find it later", which I'll call "Just Take Notes". The third is by far the most common when it comes to note taking, and variations on GTD are the most common task management system. ZTK is trendy methodology for knowledge management and discovery but doesn't really focus on task management necessarily (though some folks do bolt ZTK and GTD together!)
</p>
</div>
