hugo/blog/content/posts/my-opinions-on-notetaking.md
+++
title = "my opinions on task management and notes"
date = 2022-07-04
author = ["josiah"]
draft = false
+++

## Introduction {#introduction}

Note taking systems have come up at work a lot; flavor of the month applications (Roam Research! Obisidian!); whether you should write up notes in a private wiki; particular ideologies like [Zettelkasten](https://en.wikipedia.org/wiki/Zettelkasten) (ZTK) or [Getting Things Done](https://en.wikipedia.org/wiki/Getting_Things_Done) (GTD); etc. I have A Lot of Opinions about note taking and productivity, and wrote up a quick and dirty summary of options on apps / ideology for coworkers. This post is a longer form write up on task management, productivity systems, and notes generally from that original summary.

This post assumes you are a knowledge worker of some kind, and thus have a need for the heavier weight systems like ZTK or GTD. This post does not assume you are a programmer or work in tech, specifically. My goal is for you to feel comfortable reading this regardless of technical aptitude -- if you're the kind of person who needs a robust note / task management system then I want to help!


## Concepts / ideology / religious warfare {#concepts-ideology-religious-warfare}

Always start with ideas before implementation. I'm sure there's more sects out there than I am aware of, but broadly there are three mainstream knowledge management styles: Zettelkasten, Getting Things Done, and then just "writing shit down and hoping you find it later", which I'll call "Just Take Notes". The third is by far the most common when it comes to note taking, and variations on GTD are the most common task management system. ZTK is trendy methodology for knowledge management and discovery but doesn't really focus on task management necessarily (though some folks do bolt ZTK and GTD together!)
