source/my-opinions-on-notetaking.org
** Getting Things Done
   You can buy a book on GTD by the idea's creator, [[https://en.wikipedia.org/wiki/David_Allen_(author)][David Allen]], and if you like the system after reading about it here and want to learn it in its Pure Form or whatever then I absolutely encourage you to do that. However, my personal opinion is that adhering to the concepts outlined by its author is not all that useful to most people. Instead, I recommend taking some of GTD's core ideas and adapting them to fit your use-case.

   For example, here's a workflow sample of GTD:

 #+html:
 #+begin_box A GTD workflow sample
 1. The most annoying, distracting, or interesting task is chosen, and defined as an "incomplete".
 2. A description of the successful outcome of the "incomplete" is written down in one sentence, along with the criteria by which the task will be considered completed.
 3. The next step required to approach completion of the task is written down.
 4. A self-assessment is made of the emotions experienced after completing the steps of this process. 
 #+end_box

 This breakdown is an excellent start for many people. It helps them get their hands around a task they've been procrastinating on and show that the task is maybe more tractable than originally thought. However, I often don't /need/ this sort of thing. Slavishly reproducing this is not useful to me. Instead, I focus on the core tools and concepts required to make any GTD system function:

 Core needs (summarized):
 1. You need to be able to capture ideas/tasks/whatever as they come to you, hopefully without interrupting your workflow too much.
 2. You need to (either right away, or later during a review period) break down that idea/task, so you can figure out next steps.
 3. You need to be able to find your captured and clarified task/idea/bullshit later
 4. You need to review what you’ve captured and update/delete/whatever your bullshit
 5. (outside the scope of the system) actually do stuff with what you’ve captured.

 Core tools:
 - An inbox
 - A trash can
 - A filing system for reference material
 - A calendar 


#+begin_box Core tools explainer
 - An inbox is where un-filed ideas/tasks go. If a new idea or task comes to you, you should put it here.
 - A trash can is self-explanatory, and often doesn't have to be in the system itself; you can just delete an entry or file it away if it might be useful later.
 - A filing system allows you take un-filed items and move them to a semantically appropriate place after you've thought about it / broken it down into sub tasks / added context (like "Mowing the lawn" might go under "house maintenance"). This makes it much easier to find things later on. This is heirarchical, so you can have nested structures like "Personal" > "Relationships" > "Josiah" > a number of items relating to your relationship with me.
 - A calendar allows you to schedule tasks and mark them as due on certain dates. This is a big one for keeping me productive over the long term.
#+end_box

 With these tools you're able to meet all the requirements from the "needs" section mentioned above. When examining implementations (i.e. apps!) you want to make sure a given implementation has all the right bits that map to these tools and support these needs.

** Competing ideologies
   The other religions are wrong, kill the heretics.

*** Zettelkasten

    I know very little about ZTK other than that it exists and that scientists /love/ it. The basic idea is kind of like note cards; each idea or concept has a card, and that card will have topic tags that can be used to reference other notes. This is useful for learning about a new concept over time - it allows you to reference what you had previously understood and square it with your new understanding, as well as reference related ideas or events to explicitly deepen your understanding. One could think of this as basically "tagging, the methodology". 

    If this style makes intuitive sense for you over the hierarchical filing system approach then more power to you. Hierarchies always ended up working better for me.

