posts/my-opinions-on-notetaking.html

<div id="outline-container-org18d0893" class="outline-3">
<h3 id="org18d0893">Getting Things Done</h3>
<div class="outline-text-3" id="text-org18d0893">
<p>
You can buy a book on GTD by the idea's creator, <a href="https://en.wikipedia.org/wiki/David_Allen_(author)">David Allen</a>, and if you like the system after reading about it here and want to learn it in its Pure Form or whatever then I absolutely encourage you to do that. However, my personal opinion is that adhering to the concepts outlined by its author is not all that useful to most people. Instead, I recommend taking some of GTD's core ideas and adapting them to fit your use-case.
</p>

<p>
For example, here's a workflow sample of GTD:
</p>

<div style="padding: 1em; background-color: #2e174a;border-radius: 15px; font-size: 0.9em; box-shadow: 0.05em 0.1em 5px 0.01em #00000057;"><h3>A GTD workflow sample</h3>
<ol class="org-ol">
<li>The most annoying, distracting, or interesting task is chosen, and defined as an "incomplete".</li>
<li>A description of the successful outcome of the "incomplete" is written down in one sentence, along with the criteria by which the task will be considered completed.</li>
<li>The next step required to approach completion of the task is written down.</li>
<li>A self-assessment is made of the emotions experienced after completing the steps of this process.</li>
</ol>

</div>

<p>
This breakdown is an excellent start for many people. It helps them get their hands around a task they've been procrastinating on and show that the task is maybe more tractable than originally thought. However, I often don't <i>need</i> this sort of thing. Slavishly reproducing this is not useful to me. Instead, I focus on the core tools and concepts required to make any GTD system function:
</p>

<p>
Core needs (summarized):
</p>
<ol class="org-ol">
<li>You need to be able to capture ideas/tasks/whatever as they come to you, hopefully without interrupting your workflow too much.</li>
<li>You need to (either right away, or later during a review period) break down that idea/task, so you can figure out next steps.</li>
<li>You need to be able to find your captured and clarified task/idea/bullshit later</li>
<li>You need to review what you’ve captured and update/delete/whatever your bullshit</li>
<li>(outside the scope of the system) actually do stuff with what you’ve captured.</li>
</ol>

<p>
Core tools:
</p>
<ul class="org-ul">
<li>An inbox</li>
<li>A trash can</li>
<li>A filing system for reference material</li>
<li>A calendar</li>
</ul>


<div style="padding: 1em; background-color: #2e174a;border-radius: 15px; font-size: 0.9em; box-shadow: 0.05em 0.1em 5px 0.01em #00000057;"><h3>Core tools explainer</h3>
<ul class="org-ul">
<li>An inbox is where un-filed ideas/tasks go. If a new idea or task comes to you, you should put it here.</li>
<li>A trash can is self-explanatory, and often doesn't have to be in the system itself; you can just delete an entry or file it away if it might be useful later.</li>
<li>A filing system allows you take un-filed items and move them to a semantically appropriate place after you've thought about it / broken it down into sub tasks / added context (like "Mowing the lawn" might go under "house maintenance"). This makes it much easier to find things later on. This is heirarchical, so you can have nested structures like "Personal" &gt; "Relationships" &gt; "Josiah" &gt; a number of items relating to your relationship with me.</li>
<li>A calendar allows you to schedule tasks and mark them as due on certain dates. This is a big one for keeping me productive over the long term.</li>
</ul>

</div>

<p>
With these tools you're able to meet all the requirements from the "needs" section mentioned above. When examining implementations (i.e. apps!) you want to make sure a given implementation has all the right bits that map to these tools and support these needs.
</p>
</div>
</div>

<div id="outline-container-org4cd6664" class="outline-3">
<h3 id="org4cd6664">Competing ideologies</h3>
<div class="outline-text-3" id="text-org4cd6664">
<p>
The other religions are wrong, kill the heretics.
</p>
</div>

<div id="outline-container-orgee13acd" class="outline-4">
<h4 id="orgee13acd">Zettelkasten</h4>
<div class="outline-text-4" id="text-orgee13acd">
<p>
I know very little about ZTK other than that it exists and that scientists <i>love</i> it. The basic idea is kind of like note cards; each idea or concept has a card, and that card will have topic tags that can be used to reference other notes. This is useful for learning about a new concept over time - it allows you to reference what you had previously understood and square it with your new understanding, as well as reference related ideas or events to explicitly deepen your understanding. One could think of this as basically "tagging, the methodology". 
</p>

<p>
If this style makes intuitive sense for you over the hierarchical filing system approach then more power to you. Hierarchies always ended up working better for me.
</p>
</div>
</div>
