source/my-opinions-on-notetaking.org
*** Plain notes
    The "just take notes" method is objectively inferior to either GTD or ZTK for the knowledge worker use case. It still gets used frequently due to how difficult it is to start using a heavier weight ideology (the implementation ecosystem is pretty bad and only recently has it started improving). "Just take notes" people tend to rely on one of two methods for getting data back from entries they've added:
   - plain text search (which is very valuable, and finally being treated as important in modern note systems), or:
   - they don't. They rely on the act of recording the data to improve their memory, but never reference the recorded data ever again.

    Despite the limitations of Just Take Notes, there are two things that it usually gets right: plain text search & data portability
#+begin_details A note on plain text search
   This is not possible in many, many note taking applications. I encourage you to select for this capability; using a tool that rolls its own search /and/ does not allow plain text search is a recipe for disaster. Tech workers have probably all encountered a wiki system called [[https://en.wikipedia.org/wiki/Confluence_(software)][Confluence]] that does this. This system is near universally reviled by non-management types because its such a pain to find data once its in there. I've heard it referred to as "write once find never" software because the search is so bad.
#+end_details

#+begin_details A note on file formats and data portability
   A good note taking system should not be beholden to a single app, developer, or company. Your note system should be as future proof as possible, and to that end you should use an open data format (as in, not proprietary) that's supported by a wide range of applications. That way, if your favored app goes the way of the dodo, your notes are 4 clicks away from being imported to the next app. If you use a proprietary file format you could /lose access to all your data/ if a company goes bankrupt.

   Relatedly, you should care about where your notes are stored. Its very easy to get up and going with a cloud based note system, but the same system can cost you access and convenience in the long run. I recommend you select for a note taking app that is [[https://www.inkandswitch.com/local-first/][Local First]] - that is, it can use the cloud for backups and syncing files, but you should be storing notes locally on your devices.

   This doesn't necessarily tie into plain text search, but frequently does. If a given note taking app uses their own file format or stores all your notes in a cloud solution you are unlikely to be able to perform plain text search on your notes. This is probably not true 100% of the time, but I can't think of an exception off the top of my head.

   Modern good note taking solutions have converged on building off of one or two file formats that are human readable, stored locally as well as in a given cloud solution, and plain text searchable. The two formats are:
   - Markdown (the most common, newer, widely understood, widely supported)
   - Orgmode (more rare, older,  steeper learning curve, tooling is rougher, IMO more powerful)

   I prefer orgmode, but as long as you're on one of these two you'll be fine.
#+end_details


* Implementations and apps
  Now that we've talked about key concepts we are ready to talk about possible implementations and apps that could work for you.
** Big players
