posts/my-opinions-on-notetaking.html

<div id="outline-container-orgd7c1041" class="outline-4">
<h4 id="orgd7c1041">Plain notes</h4>
<div class="outline-text-4" id="text-orgd7c1041">
<p>
The "just take notes" method is objectively inferior to either GTD or ZTK for the knowledge worker use case. It still gets used frequently due to how difficult it is to start using a heavier weight ideology (the implementation ecosystem is pretty bad and only recently has it started improving). "Just take notes" people tend to rely on one of two methods for getting data back from entries they've added:
</p>
<ul class="org-ul">
<li>plain text search (which is very valuable, and finally being treated as important in modern note systems), or:</li>
<li><p>
they don't. They rely on the act of recording the data to improve their memory, but never reference the recorded data ever again.
</p>

<p>
Despite the limitations of Just Take Notes, there are two things that it usually gets right: plain text search &amp; data portability
</p></li>
</ul>
<details class="code-details"
                 style ="padding: 1em;
                          background-color: #2e174a;
                          /* background-color: pink; */
                          border-radius: 15px;
                          color: hsl(0 0%);
                          font-size: 0.9em;
                          box-shadow: 0.05em 0.1em 5px 0.01em  #00000057;">
                  <summary>
                    <strong>
                      <font face="Courier" size="3" color="orange">
                         A note on plain text search
                      </font>
                    </strong>
                  </summary>
<p>
This is not possible in many, many note taking applications. I encourage you to select for this capability; using a tool that rolls its own search <i>and</i> does not allow plain text search is a recipe for disaster. Tech workers have probably all encountered a wiki system called <a href="https://en.wikipedia.org/wiki/Confluence_(software)">Confluence</a> that does this. This system is near universally reviled by non-management types because its such a pain to find data once its in there. I've heard it referred to as "write once find never" software because the search is so bad.
</p>


</details>

<details class="code-details"
                 style ="padding: 1em;
                          background-color: #2e174a;
                          /* background-color: pink; */
                          border-radius: 15px;
                          color: hsl(0 0%);
                          font-size: 0.9em;
                          box-shadow: 0.05em 0.1em 5px 0.01em  #00000057;">
                  <summary>
                    <strong>
                      <font face="Courier" size="3" color="orange">
                         A note on file formats and data portability
                      </font>
                    </strong>
                  </summary>
<p>
A good note taking system should not be beholden to a single app, developer, or company. Your note system should be as future proof as possible, and to that end you should use an open data format (as in, not proprietary) that's supported by a wide range of applications. That way, if your favored app goes the way of the dodo, your notes are 4 clicks away from being imported to the next app. If you use a proprietary file format you could <i>lose access to all your data</i> if a company goes bankrupt.
</p>

<p>
Relatedly, you should care about where your notes are stored. Its very easy to get up and going with a cloud based note system, but the same system can cost you access and convenience in the long run. I recommend you select for a note taking app that is <a href="https://www.inkandswitch.com/local-first/">Local First</a> - that is, it can use the cloud for backups and syncing files, but you should be storing notes locally on your devices.
</p>

<p>
This doesn't necessarily tie into plain text search, but frequently does. If a given note taking app uses their own file format or stores all your notes in a cloud solution you are unlikely to be able to perform plain text search on your notes. This is probably not true 100% of the time, but I can't think of an exception off the top of my head.
</p>

<p>
Modern good note taking solutions have converged on building off of one or two file formats that are human readable, stored locally as well as in a given cloud solution, and plain text searchable. The two formats are:
</p>
<ul class="org-ul">
<li>Markdown (the most common, newer, widely understood, widely supported)</li>
<li>Orgmode (more rare, older,  steeper learning curve, tooling is rougher, IMO more powerful)</li>
</ul>

<p>
I prefer orgmode, but as long as you're on one of these two you'll be fine.
</p>


</details>
</div>
</div>
</div>
</div>


<div id="outline-container-org3515db0" class="outline-2">
<h2 id="org3515db0">Implementations and apps</h2>
<div class="outline-text-2" id="text-org3515db0">
<p>
Now that we've talked about key concepts we are ready to talk about possible implementations and apps that could work for you.
</p>
</div>
