source/my-opinions-on-notetaking.org
*** Emacs and org-mode
    Orgmode is a big deal in this space, and a bunch of the dissertations written about big note systems and "personal information management" came from Org mode. Org mode as a platform supports both ZTK and GTD quite well, though GTD is the standard historical system and ZTK's linked notes is more recent. Org mode GTD support is handled natively (and there are a LOT of posts about GTD with orgmode - you can read a sample of them [[https://orgmode.org/worg/org-gtd-etc.html][here]]), while ZTK is handled via the [[https://github.com/org-roam/org-roam][org-roam]] package. I'm less plugged into ZTK on Org, but you can check out the creator's [[https://blog.jethro.dev/posts/introducing_org_roam/][thoughts]] on it on their blog.

    Orgmode's has two incredible strengths:
    1. Customization
    2. History

    These two strengths play together very well. Since org-mode is open source and built on top of emacs (which is also open source), you can write extensions to modify behavior and appearance. This is huge for adapting the tool to your own needs, even within the core GTD workflow. Emacs has been around since /1976/, so there's this huge body of work to draw on from other folks. I mentioned at the outset of this post that you don't have to be a programmer to read this - emacs is the most "I want you to be a programmer" tool I'll talk about here. But if you aren't a programmer you can still be extremely productive by using community maintained user-friendly configurations. [[https://www.spacemacs.org/][Spacemacs]] (free) and [[https://github.com/doomemacs/doomemacs][doomemacs]] (free) are the two notable flavors. I'll also mention a tool i've never used but have bookmarked called [[https://easyorgmode.com/][EasyOrg]] (paid), which appears to take some of the core org mode features and put them in a slimmed down editor with normal keybinds.

    That keybind call out leads me to the weakness of the emacs/orgmode option:
    1. Ancient / unintuitive keybinding defaults
    2. A pretty terrible mobile experience

    The keybinding defaults will be unintuitive to any modern user. Copy / cut / paste are all different, and so are core movement keys. You can remap all of them, of course, but to extend or configure emacs you must write [[https://www.gnu.org/software/emacs/manual/html_node/elisp/][elisp]], which is an archaic variant of a programming language that most folks do not like. Using something like EasyOrg as mentioned above mitigates this issue to some degree, as an individual won't have to write their own configuration, but using EasyOrg is not a panacea; a pre-configured tool like that likely has some other limitations to keep in mind.

    The mobile experience sucks because there is no single official app; there's no emacs for mobile. There are, instead, many different mobile implementations that differ in goal (task management, knowledge-base access, calendar integration, git integration, etc), language, platform support, etc. If you choose to go with something like emacs + org mode you will need to evaluate mobile apps based on which feature set is important to you. I won't go into that here, but will instead list the apps worth evaluating:

    - [[https://beorgapp.com/][beorg]] (ios) (I use and recommend this)
    - [[https://plainorg.com/][plain org]] (ios)
    - [[https://flathabits.com/][flat habits]] (ios)
    - [[https://mobileorg.github.io/][mobileorg]] (ios)
    - [[https://github.com/wizmer/syncorg][syncorg]] (android)
    - [[http://www.orgzly.com/][orgzly]] (android) (I use this)

    If you use emacs already then orgmode is a great choice. There's a huge history of personal information management here, there's a ton of community resources, and you have the ability to make it do anything you could ever want. Finally, the age of emacs makes it an incredibly safe choice when thinking of longevity. Emacs has been around since the 70s; there's hardly any software that's been around that long. Of course, evidence of history does not equate to evidence of future, but its a good indicator.

    If you don't already use emacs and aren't my direct friend I mostly recommend other tools. If you're at all curious and want some help or to ask questions please feel free to [[mailto:me@jowj.net][reach out to me]], direct friend or not! I love to talk about emacs and I love to help people.
    
