posts/my-opinions-on-notetaking.html
<div id="outline-container-org848f033" class="outline-3">
<h3 id="org848f033">Big players</h3>
<div class="outline-text-3" id="text-org848f033">
</div>
<div id="outline-container-orgb82168c" class="outline-4">
<h4 id="orgb82168c">Emacs and org-mode</h4>
<div class="outline-text-4" id="text-orgb82168c">
<p>
Orgmode is a big deal in this space, and a bunch of the dissertations written about big note systems and "personal information management" came from Org mode. Org mode as a platform supports both ZTK and GTD quite well, though GTD is the standard historical system and ZTK's linked notes is more recent. Org mode GTD support is handled natively (and there are a LOT of posts about GTD with orgmode - you can read a sample of them <a href="https://orgmode.org/worg/org-gtd-etc.html">here</a>), while ZTK is handled via the <a href="https://github.com/org-roam/org-roam">org-roam</a> package. I'm less plugged into ZTK on Org, but you can check out the creator's <a href="https://blog.jethro.dev/posts/introducing_org_roam/">thoughts</a> on it on their blog.
</p>

<p>
Orgmode's has two incredible strengths:
</p>
<ol class="org-ol">
<li>Customization</li>
<li>History</li>
</ol>

<p>
These two strengths play together very well. Since org-mode is open source and built on top of emacs (which is also open source), you can write extensions to modify behavior and appearance. This is huge for adapting the tool to your own needs, even within the core GTD workflow. Emacs has been around since <i>1976</i>, so there's this huge body of work to draw on from other folks. I mentioned at the outset of this post that you don't have to be a programmer to read this - emacs is the most "I want you to be a programmer" tool I'll talk about here. But if you aren't a programmer you can still be extremely productive by using community maintained user-friendly configurations. <a href="https://www.spacemacs.org/">Spacemacs</a> (free) and <a href="https://github.com/doomemacs/doomemacs">doomemacs</a> (free) are the two notable flavors. I'll also mention a tool i've never used but have bookmarked called <a href="https://easyorgmode.com/">EasyOrg</a> (paid), which appears to take some of the core org mode features and put them in a slimmed down editor with normal keybinds.
</p>

<p>
That keybind call out leads me to the weakness of the emacs/orgmode option:
</p>
<ol class="org-ol">
<li>Ancient / unintuitive keybinding defaults</li>
<li>A pretty terrible mobile experience</li>
</ol>

<p>
The keybinding defaults will be unintuitive to any modern user. Copy / cut / paste are all different, and so are core movement keys. You can remap all of them, of course, but to extend or configure emacs you must write <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/">elisp</a>, which is an archaic variant of a programming language that most folks do not like. Using something like EasyOrg as mentioned above mitigates this issue to some degree, as an individual won't have to write their own configuration, but using EasyOrg is not a panacea; a pre-configured tool like that likely has some other limitations to keep in mind.
</p>

<p>
The mobile experience sucks because there is no single official app; there's no emacs for mobile. There are, instead, many different mobile implementations that differ in goal (task management, knowledge-base access, calendar integration, git integration, etc), language, platform support, etc. If you choose to go with something like emacs + org mode you will need to evaluate mobile apps based on which feature set is important to you. I won't go into that here, but will instead list the apps worth evaluating:
</p>

<ul class="org-ul">
<li><a href="https://beorgapp.com/">beorg</a> (ios) (I use and recommend this)</li>
<li><a href="https://plainorg.com/">plain org</a> (ios)</li>
<li><a href="https://flathabits.com/">flat habits</a> (ios)</li>
<li><a href="https://mobileorg.github.io/">mobileorg</a> (ios)</li>
<li><a href="https://github.com/wizmer/syncorg">syncorg</a> (android)</li>
<li><a href="http://www.orgzly.com/">orgzly</a> (android) (I use this)</li>
</ul>

<p>
If you use emacs already then orgmode is a great choice. There's a huge history of personal information management here, there's a ton of community resources, and you have the ability to make it do anything you could ever want. Finally, the age of emacs makes it an incredibly safe choice when thinking of longevity. Emacs has been around since the 70s; there's hardly any software that's been around that long. Of course, evidence of history does not equate to evidence of future, but its a good indicator.
</p>

<p>
If you don't already use emacs and aren't my direct friend I mostly recommend other tools. If you're at all curious and want some help or to ask questions please feel free to <a href="mailto:me@jowj.net">reach out to me</a>, direct friend or not! I love to talk about emacs and I love to help people.
</p>
</div>
</div>
