posts/my-opinions-on-notetaking.html

<div id="outline-container-org7549c76" class="outline-4">
<h4 id="org7549c76">Obsidian</h4>
<div class="outline-text-4" id="text-org7549c76">
<p>
<a href="https://obsidian.md/">Obsidian</a> is a new and growing-in-popularity documentation tool. Its big strength is its <a href="https://obsidian.md/plugins">plugin</a> system and vibrant <a href="https://obsidian.md/community">community</a> - like emacs, there's probably someone else who has tried to do what you need before, and they may even have published an addon you can adapt to fit your needs. To be clear, if you want to write your own addon you'll need to be able to program, but using community available addons is easy, free, and does not require programming knowledge. The ability to support workflow customization is huge, though, and the presence of that feature is a big draw for me. Obsidian supports ZTK out the box - it looks really nice, I encourage you to check out the homepage for pretty graphs about note connectivity. It also supports GTD through the use of addons (probably a few, <a href="https://github.com/larslockefeer/obsidian-plugin-todo">this one</a> seems to be the most popular).
</p>

<p>
Obsidian's business model is worth calling out here, as its a bit different than what you'd expect. The core tool is free for personal users, with a recurring yearly fee per user for commercial uses. However, there are two proprietary addons made by the Obsidian core team, not the community, that are also charged for: sync and publish. Sync is end to end encrypted, platform agnostic sync between devices. Its pretty great. Sync also includes 1 year of version history, which is <i>really</i> fucking great. Publish is a bit less useful for the average user, but still quite nice: it allows you to publish your obsidian notes as a blog, under your own domain. You can view some samples of what it looks like <a href="https://obsidian.md/publish">here</a>, by scrolling down. 
</p>

<p>
There are not too many downsides for Obsidian, and this is the app that I recommend to most folks who are looking: its based on markdown, which most people are familiar with; its free for personal users; it has a plugin/addon concept, and you can write your own if you really hit a wall; the company seems to have a decent revenue stream in certain paid addons + commercial offerings. However, just to be thorough, I'll mention that its not open source. If you care about that you're better off with something like emacs+orgmode for its freedom guarantees.
</p>
</div>
</div>

<div id="outline-container-orgf9acabf" class="outline-4">
<h4 id="orgf9acabf">Roam Research</h4>
<div class="outline-text-4" id="text-orgf9acabf">
<p>
RR seems to be a favored tool of many academics, though I have several issues with this and overall <b>would not recommend this to the average user</b>. Roam is a knowledge base / wiki style tool that supports ZTK workflows very well, and can be made to support GTD. I won't go in depth on this tool, but did feel the need to mention it due to its large popularity. Even the Orgmode ZTK module is named after this tool! The biggest reason I do not recommend RR is that is it <i>online first</i> software. Its built out of the browser, and while it has an app, many features don't work unless you're running it in a regular chrome window (apparently including local backups, which feels insane).
</p>

<p>
Here are some articles that go into further info on RR if you are curious:
</p>
<ul class="org-ul">
<li><a href="https://roamresearch.com/#/app/help/page/dZ72V0Ig6">The roam whitepaper</a></li>
<li><a href="https://www.nateliason.com/blog/roam">Someone loves Roam and goes into loving detail about why</a></li>
<li><a href="https://capiche.com/e/roam-research-worldwideweb-xanadu">Someone argues that Roam is the religious successor to the original web</a> (which I think is dumb, but Roam links to this on their website)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0f4ac9b" class="outline-3">
<h3 id="org0f4ac9b">Honerable mentions</h3>
<div class="outline-text-3" id="text-org0f4ac9b">
<p>
I don't want to go in depth on these so much as mention them. They are important, and in some cases historically the only option, but not what I recommend if you need a real heavy weight system.
</p>
</div>
<div id="outline-container-orge8e4f5e" class="outline-4">
<h4 id="orge8e4f5e">Onenote</h4>
<div class="outline-text-4" id="text-orge8e4f5e">
<p>
I would be convicted of a crime if I didn't mention <a href="https://www.microsoft.com/en-us/microsoft-365/onenote/digital-note-taking-app">Onenote</a>. Excellent basic note offering, works everywhere. You're reliant on Microsoft, which is a blessing and a curse - they will absolutely have revenue forever, but they also can cancel/ruin projects that are critical to you (see Skype/Lync/Teams fuckery). There's not good support for GTD or ZTK, though you can kludge stuff together with tags for both systems. There is no ability to extend onenote functionality if you hit a wall in the default offering.
</p>
</div>
</div>
