posts/my-opinions-on-notetaking.html
<div id="outline-container-org75134d6" class="outline-4">
<h4 id="org75134d6">Evernote</h4>
<div class="outline-text-4" id="text-org75134d6">
<p>
<a href="https://evernote.com/">Evernote</a> is historically significant, but hasn't done as well in recent years. It is an intermediate app, and sits awkwardly between the intro-friendly Onenote and a heavier-weight system like Obsidian. It has apps that run everywhere and a great set of integrations which allow the user to pull data into their Evernote system automatically via feeds or app specific integrations (for instance, gcal data). Unfortunately, it suffers performance issues and lacks the openness that make Emacs+orgmode or Obsidian so powerful. Like Onenote, there is no way to write your own extension if you need to adapt the tool to your own workflows.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org1e0bf61" class="outline-2">
<h2 id="org1e0bf61">Wrap up</h2>
<div class="outline-text-2" id="text-org1e0bf61">
<p>
I have notes going back years and years that are stuck in proprietary systems or languishing in systems that require manual work to migrate away from. I moved to emacs+orgmode in 2016/2017 and since then all my notes and tasks remain accessible and plain text searchable. It is worth spending real time choosing the appropriate system and implementation for you. I derive an incredible amount of value from my historic notes - it lets me: see what I've worked on, save WIP projects for open-ended periods of time when I have RSI flare ups, keep robust documentation around infrastructure and home care, and tons more. Especially at work this is a super power! I take notes, record issues I have with projects, and can refer back to anything relevant with a quick search. My performance at work is tied to how good my notes and task management systems are!
</p>

<p>
You should spend time on this too. If you have questions I want to hear from you :) .
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p></p>
</div>
</body>
</html>
